name: "resnet_classifier"
platform: "tensorrt_plan"  
max_batch_size: 1

input [
  {
    name: "input"
    data_type: TYPE_FP32
    dims: [3, 224, 224]
  }
]

output [
  {
    name: "output"
    data_type: TYPE_FP32
    dims: [3]
  }
]

instance_group [
  {
    count: 1
    kind: KIND_GPU
    gpus: [0]
  }
]

version_policy: {
  latest {
    num_versions: 1
  }
}

